{
	"method": "PUT",
	"url": "/ipds/waf/<name>",
	"action": "set",
	"description": "Modify the global setting of a WAF ruleset. The name is the WAF ruleset unique identifier.",
	"params": {
		"audit": {
			"description": "The possible values are: true, enables the audit; or false, disables the audit logging.",
			"regex": "$boolean",
			"non_blank": "true"
		},
		"process_request_body": {
			"description": "This parameter enables the checking of the request body HTTP. The possible values are true to enable the check; or false to disable the check.",
			"regex": "$boolean",
			"non_blank": "true"
		},
		"process_response_body": {
			"description": "This parameter enables the checking of the response body HTTP. The possible values are true to enable the check; or false to disable the check.",
			"regex": "$boolean",
			"non_blank": "true"
		},
		"request_body_limit": {
			"description": "Set a limit to the HTTP request body. This number is the size in Bytes.",
			"regex": "$natural_num"
		},
		"only_logging": {
			"description": "",
			"regex": "$boolean",
			"non_blank": "true"
		},
		"default_action": {
			"description": "It is the default value to the action rule parameter. The possible values are: pass, the rule will apply the other options configured and the request won’t be cut; deny, ends the connection, the rest of rules won’t be executed; redirect:, the client will be redirected to the set URL; block, the rule will execute the action that was set in the configuration set default_action. To enable this action, it is necessary to have set parameter status to on.",
			"values": [
				"allow",
				"redirect",
				"pass",
				"deny"
			],
			"non_blank": "true"
		},
		"default_log": {
			"description": "It is the default value to the log rule parameter. If its value is set to true all matches will be logged. If its value is set to false the matches will no be logged.",
			"regex": "$waf_log"
		},
		"default_phase": {
			"description": "It is the default value to the phase rule parameter. The phase represents the point of the HTTP request where a rule will be executed. The possible values are 1, it is executed when the request headers are received; 2, it is executed when the body request is received; 3, it is executed when the response headers are received; 4, it is executed when the response body is received; or 5, it is executed just before logging.",
			"regex": "$waf_phase",
			"non_blank": "true"
		},
		"disable_rules": {
			"description": "It is a list of rule_id. All of them will be disabled.",
			"ref": "array",
			"regex": "$waf_rule_id"
		},
		"redirect_url": {
			"description": "It is the URL where redirecting the client in the case that the resolution redirect is executed. This parameter can be set only when the rule resolution has the value redirect.",
			"non_blank": "true",
			"depend_on": "default_action==redirect"
		}
	}
}
